# Akses nilai variabel pada query()

### Import Modul dan Cek Versi

In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.3.4
1.20.3

### Persiapan Data Frame

In [2]:
n_rows = 5 
n_cols = 5 
cols = tuple ('ABCDE')
df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)), columns=cols)
df

    A   B   C   D   E
0  13  19   7  10   9
1   4  19   7  17  15
2   6   5   5  15  11
3   7   3  12  11  14
4  14   8   4   4   9

# Melakukan seleksi baris

In [3]:
df.query('A > 10')

    A   B  C   D  E
0  13  19  7  10  9
4  14   8  4   4  9

# Menghitung nilai rata-rata dari kolom A

In [4]:
rerata = df['A'].mean()
rerata

8.8

In [5]:
df.query('A > @rerata')

    A   B  C   D  E
0  13  19  7  10  9
4  14   8  4   4  9